Solderingironspb/CH32V203C8T6_RVMSIS_notes/CH32V203C8T6/Core/Src/ch32v20x_RVMSIS.c
/**
 ******************************************************************************
 *  @file ch32v20x_RVMSIS.h
 *  @brief RVMSIS на примере МК CH32V203C8T6
 *  @author Волков Олег
 *  @date 31.03.2023
 *
 ******************************************************************************
 * @attention
 *
 *  Библиотека помогает разобраться с библиотекой RVMSIS на примере
 *  МК CH32V203C8T6
 *
 *  YouTube: https://www.youtube.com/channel/UCzZKTNVpcMSALU57G1THoVw
 *  GitHub: https://github.com/Solderingironspb/STM32F103C8T6_CMSIS_notes
 *  Группа ВК: https://vk.com/solderingiron.stm32
 *  Работал по документации: http://www.wch-ic.com/products/CH32V203.html?
 *
 ******************************************************************************
 */
#include "ch32v20x_RVMSIS.h"

/*================================= НАСТРОЙКА DEBUG ============================================*/
/**
 ***************************************************************************************
 *  @breif Debug port mapping
 ***************************************************************************************
 */
void RVMSIS_Debug_init(void) {
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOA); //Запустим тактирование порта A
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_AFIO); //Запустим тактирование альтернативных функций
    MODIFY_REG(AFIO->PCFR1, AFIO_PCFR1_SWJ_CFG, 0b000 << AFIO_PCFR1_SWJ_CFG_Pos); //Serial wire

    /**
     *  При выборе Serial wire:
     *  PA13 /JTMS/SWDIO
     *  PA14 /JTCK/SWCLK.
     *  PA15, PB3 и PB4 свободны
     */
    /*Заблокируем доступ для редактирования конфигурации PA13 и PA14*/

    GPIOA->LCKR = GPIO_LCKK | GPIO_LCK13 | GPIO_LCK14;
    GPIOA->LCKR = GPIO_LCK13 | GPIO_LCK14;
    GPIOA->LCKR = GPIO_LCKK | GPIO_LCK13 | GPIO_LCK14;
    GPIOA->LCKR;
}

/*============================== НАСТРОЙКА RCC =======================================*/
/**
 ***************************************************************************************
 *  @breif Настройка МК CH32V203C8T6 на частоту 144MHz от внешнего кварцевого резонатора
 *  P.S. можете кидать в меня камнями, но я считаю, что от 144МГц тут пользы, как
 *  от козла молока) I2C1 и I2C2 на APB1. Для них максимум 36 МГц.
 *  Скорость FLASH максимум 60 МГц, а делитель там есть только на 2, что опять
 *  не дает нам выставить 144 МГц. А если мы хотим работать с ADC, то опять же, на APB2
 *  мы не можем выставить 144 МГц, т.к. максимальный делитель 8(144/8 = 18МГц.)
 *  А максимум для АЦП - 14 МГц...Поэтому для универсальной работы всего, частоты задирать
 *  выше 72 МГц не будем.
 *  Внешний кварцевый резонатор на 8 MHz
 *  ADC настроен на 12MHz
 *  USB настроен на 48MHz
 *  MCO подключен к HSE и тактируется от 8MHz
 *
 ***************************************************************************************
 */
void RVMSIS_RCC_SystemClock_144MHz(void) {
    SET_BIT(RCC->CTLR, RCC_HSION); //Запустим внутренний RC генератор на 8 МГц
    while (READ_BIT(RCC->CTLR, RCC_HSIRDY) == 0);
    //Дождемся поднятия флага о готовности
    CLEAR_BIT(RCC->CTLR, RCC_HSEBYP);//Просто сбросим этот бит в 0(Хотя изначально он и так должен быть в 0).
    SET_BIT(RCC->CTLR, RCC_HSEON); //Запустим внешний кварцевый резонатор. Он у нас на 8 MHz.
    while (READ_BIT(RCC->CTLR, RCC_HSERDY) == 0);
    //Дождемся поднятия флага о готовности
    SET_BIT(RCC->CTLR, RCC_CSSON);//Включим CSS
    MODIFY_REG(RCC->CFGR0, RCC_SW, 0b01 << RCC_SW_Pos); //Выберем HSE в качестве System Clock(PLL лучше пока не выбирать, он у нас отключен)
    CLEAR_BIT(RCC->CTLR, RCC_PLLON); //Выключим PLL
    MODIFY_REG(RCC->CFGR0, RCC_HPRE, RCC_HPRE_DIV2); //AHB prescaler /2
    //Note: FLASH access clock frequency cannot
    //be more than 60 MHz.
    CLEAR_BIT(FLASH->CTLR, 1 << 25U); //0: FLASH access clock frequency = SYSCLK/2.
    MODIFY_REG(RCC->CFGR0, RCC_PPRE1, RCC_PPRE1_DIV2); //APB1 Prescaler /2,  72/2 = 36 MHz.(Иначе у нас I2C будет не настроить...)
    MODIFY_REG(RCC->CFGR0, RCC_PPRE2, RCC_PPRE2_DIV1); //APB2 Prescaler /1. Будет 72MHz.
    MODIFY_REG(RCC->CFGR0, RCC_ADCPRE, RCC_ADCPRE_DIV6); //ADC Prescaler /6, чтоб было 12MHz, т.к. максимальная частота тут 14 MHz
    CLEAR_BIT(RCC->CFGR0, RCC_PLLXTPRE); //0: HSE clock not divided.
    SET_BIT(RCC->CFGR0, RCC_PLLSRC); //В качестве входного сигнала для PLL выберем HSE
    MODIFY_REG(RCC->CFGR0, RCC_PLLMULL, 0b1111 << RCC_PLLMULL_Pos); //т.к. кварц у нас 8Mhz, а нам нужно 144MHz, то в PLL нужно сделать умножение на 18. 8MHz * 18 = 144MHz.
    MODIFY_REG(RCC->CFGR0, RCC_USBPRE, 0b10 << RCC_USBPRE_Pos); //10: Divided by 3 (when PLLCLK=144MHz); 144/3 = 48 МГц
    MODIFY_REG(RCC->CFGR0, RCC_CFGR0_MCO, RCC_CFGR0_MCO_HSE); //В качестве тактирования для MCO выбрал HSE. Будет 8 MHz.
    SET_BIT(RCC->CTLR, RCC_PLLON); //Запустим PLL

    //Т.к. PLL уже запущен, выберем его в качестве System Clock:
    MODIFY_REG(RCC->CFGR0, RCC_SW, 0b10 << RCC_SW_Pos);//Выберем PLL в качестве System Clock
    while (READ_BIT(RCC->CTLR, RCC_PLLRDY) == 0);
    //Дожидемся поднятия флага включения PLL

}

/*========================= НАСТРОЙКА СИСТЕМНОГО ТАЙМЕРА ==============================*/

/**
 ***************************************************************************************
 *  @breif Настройка SysTick на микросекунды
 *  На этом таймере мы настроим Delay и аналог HAL_GetTick()
 ***************************************************************************************
 */
void RVMSIS_SysTick_Timer_init(void) {
    SysTick->CTLR &= ~(1 << 0); //Выключим таймер для проведения настроек.
    SysTick->CTLR |= (1 << 1); //1: Enable counter interrupts.
    SysTick->CTLR &= ~(1 << 2); //0: HCLK for time base.144/8 =18
    SysTick->CTLR |= (1 << 3); //1: Re-counting from 0 after counting up to the comparison value, and re-counting from the comparison value after counting down to 0
    SysTick->CTLR |= (1 << 4); //0: Counting up.
    SysTick->CTLR |= (1 << 5); //1: Updated to 0 on up counts, updated to the comparison value on down counts.
    SysTick->CMP = 8999; ////Настроим прерывание на частоту в 1 кГц(т.е. сработка будет каждую мс) 18000000 / 18000 = 1000Гц
    NVIC_EnableIRQ(SysTicK_IRQn);
    SysTick->CTLR |= (1 << 0); //Запустим таймер.
}

/**
 ***************************************************************************************
 *  @breif Настройка Delay и аналог HAL_GetTick()
 ***************************************************************************************
 */
volatile uint32_t SysTimer_ms = 0; //Переменная, аналогичная HAL_GetTick()
volatile uint32_t Delay_counter_ms = 0; //Счетчик для функции Delay_ms
volatile uint32_t Timeout_counter_ms = 0; //Переменная для таймаута функций

/**
 ******************************************************************************
 *  @breif Прерывание по флагу CNTIF
 ******************************************************************************
 */
void SysTick_Handler(void) {
    SysTick->SR &= ~(1 << 0);
    SysTimer_ms++;

    if (Delay_counter_ms) {
        Delay_counter_ms--;
    }
    if (Timeout_counter_ms) {
        Timeout_counter_ms--;
    }
}

/**
 ******************************************************************************
 *  @breif Delay_ms
 *  @param   uint32_t Milliseconds - Длина задержки в миллисекундах
 ******************************************************************************
 */
void Delay_ms(uint32_t Milliseconds) {
    Delay_counter_ms = Milliseconds;
    while (Delay_counter_ms != 0);
}

/*============================== НАСТРОЙКА GPIO =======================================*/

/**
 ***************************************************************************************
 *  @breif Инициализация PIN PC13 на выход в режиме Push-Pull с максимальной скоростью 50 MHz
 *  Перед настройкой (GPIOs and AFIOs) нужно включить тактирование порта.
 ***************************************************************************************
 */
void RVMSIS_PC13_OUTPUT_Push_Pull_init(void) {
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOC); //Запустим тактирование порта C
    MODIFY_REG(GPIOC->CFGHR, GPIO_CFGHR_MODE13, 0b10 << GPIO_CFGHR_MODE13_Pos); //Настройка GPIOC порта 13 на выход со максимальной скоростью в 50 MHz
    MODIFY_REG(GPIOC->CFGHR, GPIO_CFGHR_CNF13, 0b00 << GPIO_CFGHR_CNF13_Pos); //Настройка GPIOC порта 13 на выход в режиме Push-Pull

