Solderingironspb/CH32V203C8T6_RVMSIS_notes/CH32V203C8T6/Core/Src/ch32v20x_RVMSIS.c
}

/**
 ***************************************************************************************
 *  @breif Blink PIN PC13 на выход в режиме Push-Pull
 ***************************************************************************************
 */
void RVMSIS_Blink_PC13(uint32_t ms) {
    GPIOC->BSHR = GPIO_BSHR_BR13;
    Delay_ms(ms);
    GPIOC->BSHR = GPIO_BSHR_BS13;
    Delay_ms(ms);
}

/**
 ***************************************************************************************
 *  @breif Настройка MCO c выходом на ножку PA8
 *  Перед настройкой (GPIOs and AFIOs) нужно включить тактирование порта.
 ***************************************************************************************
 */
void RVMSIS_PA8_MCO_init(void) {
    //Тактирование MCO должно быть настроено в регистре RCC
    MODIFY_REG(RCC->CFGR0, RCC_CFGR0_MCO, RCC_CFGR0_MCO_SYSCLK); //В качестве тактирования для MCO выбрал HSE. Будет 8 MHz.
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOA); //Запустим тактирование порта A
    MODIFY_REG(GPIOA->CFGHR, GPIO_CFGHR_MODE8, 0b11 << GPIO_CFGHR_MODE8_Pos); //Настройка GPIOA порта 8 на выход со максимальной скоростью в 50 MHz
    MODIFY_REG(GPIOA->CFGHR, GPIO_CFGHR_CNF8, 0b10 << GPIO_CFGHR_CNF8_Pos); //Настройка GPIOA порта 8, как альтернативная функция, в режиме Push-Pull
}

/*================================ РЕЖИМ EXTI =======================================*/

/**
 ***************************************************************************************
 *  @breif Режим EXTI.
 ***************************************************************************************
 */
void RVMSIS_EXTI0_init(void) {
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_AFIO); //Запуск тактирования альтернативных функций
    MODIFY_REG(AFIO->EXTICR[0], AFIO_EXTICR1_EXTI0, AFIO_EXTICR1_EXTI0_PB); //AFIO_EXTICR1, EXTI0, выбран порт B.
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOB); //Включим тактирование порта B
    MODIFY_REG(GPIOB->CFGLR, GPIO_CFGLR_CNF0, 0b10 << GPIO_CFGLR_CNF0_Pos); //Настроим ножку PB0 в режим Input with pull-up / pull-down
    MODIFY_REG(GPIOB->CFGLR, GPIO_CFGLR_MODE0, 0b00 << GPIO_CFGLR_MODE0_Pos); //Настройка в режим Input
    GPIOB->BSHR = GPIO_BSHR_BR0; //Подтяжка к земле
    SET_BIT(EXTI->INTENR, EXTI_INTENR_MR0); //Включаем прерывание EXTI0 по входному сигналу
    SET_BIT(EXTI->RTENR, EXTI_RTENR_TR0); //Реагирование по фронту вкл.
    SET_BIT(EXTI->FTENR, EXTI_FTENR_TR0); //Реагирование по спаду вкл.
    //SET_BIT(EXTI->SWIEVR, EXTI_SWIEVR_SWIEVR0);//Это софтварное включение прерывания
    //SET_BIT(EXTI->INTFR, EXTI_INTF_INTF0); //Команда выхода из прерывания
    NVIC_EnableIRQ(EXTI0_IRQn);

}

__WEAK void EXTI0_IRQHandler(void) {

    SET_BIT(EXTI->INTFR, EXTI_INTF_INTF0); //Команда выхода из прерывания

}

/*================================ Таймеры на примере TIM3 =======================================*/

void RVMSIS_TIM3_init(void) {
    /*Включим тактирование таймера (страница 48)*/
    SET_BIT(RCC->APB1PCENR, RCC_APB1Periph_TIM3); //Запуск тактирования таймера 3
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_AFIO); //Запуск тактирования альтернативных функций

    CLEAR_BIT(TIM3->CTLR1, TIM_UDIS); //Генерировать событие Update
    CLEAR_BIT(TIM3->CTLR1, TIM_URS); //Генерировать прерывание
    CLEAR_BIT(TIM3->CTLR1, TIM_OPM); //One pulse mode off(Счетчик не останавливается при обновлении)
    CLEAR_BIT(TIM3->CTLR1, TIM_DIR); //Считаем вниз
    MODIFY_REG(TIM3->CTLR1, TIM_CMS, 0b00 << TIM_CMS_Pos); //Выравнивание по краю
    SET_BIT(TIM3->CTLR1, TIM_ARPE); //Auto-reload preload enable
    MODIFY_REG(TIM3->CTLR1, TIM_CTLR1_CKD, 0b00 << TIM_CTLR1_CKD_Pos); //Предделение выключено

    /*Настройка прерываний (Страница 409)*/
    SET_BIT(TIM3->DMAINTENR, TIM_UIE); //Update interrupt enable

    TIM3->PSC = 14400 - 1;
    TIM3->ATRLR = 10 - 1;

    NVIC_EnableIRQ(TIM3_IRQn); //Разрешить прерывания по таймеру 3
    SET_BIT(TIM3->CTLR1, TIM_CEN); //Запуск таймера
}

__WEAK void TIM3_IRQHandler(void) {
    if (READ_BIT(TIM3->INTFR, TIM_UIF)) {
        CLEAR_BIT(TIM3->INTFR, TIM_UIF); //Сбросим флаг прерывания
    }
}

void RVMSIS_TIM3_PWM_CHANNEL1_init(void) {
    /*Настройка ножки PA6 под ШИМ*/
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOA); //Включим тактирование порта А
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_CNF6, 0b10 << GPIO_CFGLR_CNF6_Pos);
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_MODE6, 0b11 << GPIO_CFGLR_MODE6_Pos);

    /*Настройка шим(Канал 1)*/
    MODIFY_REG(TIM3->CHCTLR1, TIM_CC1S, 0b00 << TIM_CC1S_Pos); //CC1 channel is configured as output
    CLEAR_BIT(TIM3->CHCTLR1, TIM_OC1FE); //Fast mode disable
    SET_BIT(TIM3->CHCTLR1, TIM_OC1PE); //Preload enable
    MODIFY_REG(TIM3->CHCTLR1, TIM_OC1M, 0b110 << TIM_OC1M_Pos); //PWM MODE 1
    CLEAR_BIT(TIM3->CHCTLR1, TIM_OC1CE); //OC1Ref is not affected by the ETRF input

    /*Запуск ШИМ*/
    //15.4.9 TIMx capture/compare enable register (TIMx_CCER)
    SET_BIT(TIM3->CCER, TIM_CC1E);//On - OC1 signal is output on the corresponding output pin.
    SET_BIT(TIM3->CCER, TIM_CC1P); //OC1 active high.

    TIM3->CH1CVR = 5;
}

void RVMSIS_TIM3_PWM_CHANNEL2_init(void) {
    /*Настройка ножки PA7 под ШИМ*/
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOA); //Включим тактирование порта А
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_CNF7, 0b10 << GPIO_CFGLR_CNF7_Pos);
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_MODE7, 0b11 << GPIO_CFGLR_MODE7_Pos);

    /*Настройка шим(Канал 2)*/
    /*Настройка шим(Канал 1)*/
    MODIFY_REG(TIM3->CHCTLR1, TIM_CC2S, 0b00 << TIM_CC1S_Pos); //CC1 channel is configured as output
    CLEAR_BIT(TIM3->CHCTLR1, TIM_OC2FE); //Fast mode disable
    SET_BIT(TIM3->CHCTLR1, TIM_OC2PE); //Preload enable
    MODIFY_REG(TIM3->CHCTLR1, TIM_OC2M, 0b110 << TIM_OC2M_Pos); //PWM MODE 1
    CLEAR_BIT(TIM3->CHCTLR1, TIM_OC2CE); //OC1Ref is not affected by the ETRF input

    /*Запуск ШИМ*/
    //15.4.9 TIMx capture/compare enable register (TIMx_CCER)
    SET_BIT(TIM3->CCER, TIM_CC2E);//On - OC1 signal is output on the corresponding output pin.
    CLEAR_BIT(TIM3->CCER, TIM_CC2P); //OC1 active high.

    TIM3->CH2CVR = 5;
}

/*================================= НАСТРОЙКА ADC ============================================*/

/**
 ***************************************************************************************
 *  @breif Analog-to-digital converter (ADC)
 ***************************************************************************************
 */

volatile uint16_t ADC_RAW_Data[2] = { 0, }; //Массив, куда будем кидать данные с АЦП

void RVMSIS_ADC_DMA_init(void) {
    //Chapter 11 Direct Memory Access Control (DMA)
    SET_BIT(RCC->AHBPCENR, RCC_AHBPeriph_DMA1); //Включение тактирования DMA1
    DMA1_Channel1->PADDR = (uint32_t) &(ADC1->RDATAR); //Задаем адрес периферийного устройства
    DMA1_Channel1->MADDR = (uint32_t) ADC_RAW_Data; //Задаем адрес в памяти, куда будем кидать данные.
    DMA1_Channel1->CNTR = 2; //Настроим количество данных для передачи. После каждого периферийного события это значение будет уменьшаться.
    MODIFY_REG(DMA1_Channel1->CFGR, DMA_CFGR1_PL, 0b00 << DMA_CFGR1_PL_Pos); //Зададим приоритет канала на высокий
    CLEAR_BIT(DMA1_Channel1->CFGR, DMA_CFGR1_DIR); //Чтение будем осуществлять с периферии
    SET_BIT(DMA1_Channel1->CFGR, DMA_CFGR1_CIRC); //Настроим DMA в Circular mode
    MODIFY_REG(DMA1_Channel1->CFGR, DMA_CFGR1_PSIZE, 0b01 << DMA_CFGR1_PSIZE_Pos); //Размер данных периферийного устройства 16 бит
    MODIFY_REG(DMA1_Channel1->CFGR, DMA_CFGR1_MSIZE, 0b01 << DMA_CFGR1_MSIZE_Pos); //Размер данных в памяти 16 бит
    SET_BIT(DMA1_Channel1->CFGR, DMA_CFGR1_TCIE); //Включим прерывание по полной передаче
    CLEAR_BIT(DMA1_Channel1->CFGR, DMA_CFGR1_HTIE); //Отключим прерывание по половинной передаче
    SET_BIT(DMA1_Channel1->CFGR, DMA_CFGR1_TEIE); //Включим прерывание по ошибке передачи.
    SET_BIT(DMA1_Channel1->CFGR, DMA_CFGR1_MINC); //Включим инкрементирование памяти
    SET_BIT(DMA1_Channel1->CFGR, DMA_CFGR1_EN); //DMA ON
    NVIC_EnableIRQ(DMA1_Channel1_IRQn);

