Solderingironspb/CH32V203C8T6_RVMSIS_notes/CH32V203C8T6/Core/Src/ch32v20x_RVMSIS.c
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_ADC1); //Включение тактирования ADC1.
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOA); //Включение тактирования порта А.

    /*Настройка ножек PA0 и PA1 на аналоговый вход*/
    /*Pin PA0 - Analog*/
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_CNF0, 0b00 << GPIO_CFGLR_CNF0_Pos);
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_MODE0, 0b00 << GPIO_CFGLR_MODE0_Pos);

    /*Pin PA1 - Analog*/
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_CNF1, 0b00 << GPIO_CFGLR_CNF1_Pos);
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_MODE1, 0b00 << GPIO_CFGLR_MODE1_Pos);

    //Прерывание по АЦП: регулярные каналы (вкл/выкл)
    CLEAR_BIT(ADC1->CTLR1, ADC_EOCIE);//EOC interrupt enabled/disabled. An interrupt is generated when the EOC bit is set

    //Прерывание по АЦП: analog watchdog (вкл/выкл)
    CLEAR_BIT(ADC1->CTLR1, ADC_AWDIE);//Analog watchdog interrupt disabled

    //Прерывание по АЦП: инжектированные каналы (вкл/выкл)
    CLEAR_BIT(ADC1->CTLR1, ADC_JEOCIE);//JEOC interrupt disabled

    SET_BIT(ADC1->CTLR1, ADC_SCAN); //Scan mode enabled

    /* Примечание:
     * Прерывание EOC или JEOC генерируется только в конце преобразования последнего канала,
     * если установлен соответствующий бит EOCIE или JEOCIE.*/

    CLEAR_BIT(ADC1->CTLR1, ADC_AWDSGL); //Analog watchdog enabled on all channels
    CLEAR_BIT(ADC1->CTLR1, ADC_JAUTO); //Automatic injected group conversion disabled
    CLEAR_BIT(ADC1->CTLR1, ADC_DISCEN); //Discontinuous mode on regular channels disabled
    CLEAR_BIT(ADC1->CTLR1, ADC_JDISCEN); //Discontinuous mode on injected channels disabled
    MODIFY_REG(ADC1->CTLR1, ADC_DUALMOD, 0b0110 << ADC_DUALMOD_Pos); //0110: Regular simultaneous mode only
    CLEAR_BIT(ADC1->CTLR1, ADC_JAWDEN); //Analog watchdog disabled on injected channels
    CLEAR_BIT(ADC1->CTLR1, ADC_AWDEN); //Analog watchdog disabled on regular channels

    //Control register 2 CTLR2
    SET_BIT(ADC1->CTLR2, ADC_ADON);//Запустить АЦП

    /* Примечание:
     * Если в этот же момент изменяется какой-либо другой бит в этом регистре,
     * кроме ADON, то конверсия не запускается.
     * Это сделано для предотвращения ошибочного преобразования.*/

    SET_BIT(ADC1->CTLR2, ADC_CONT); //Continuous conversion mode(непрерывные преобразования)
    SET_BIT(ADC1->CTLR2, ADC_CAL); //Enable calibration
    /*Примечание:
     * Этот бит устанавливается программой для запуска калибровки.
     * Он сбрасывается аппаратно после завершения калибровки.*/

    while (READ_BIT(ADC1->CTLR2, ADC_CAL));
    //Подождем окончания калибровки
    //Delay_ms(10);

    SET_BIT(ADC1->CTLR2, ADC_DMA);//DMA включен
    CLEAR_BIT(ADC1->CTLR2, ADC_ALIGN); //Выравнивание по правому краю
    MODIFY_REG(ADC1->CTLR2, ADC_EXTSEL, 0b111 << ADC_EXTSEL_Pos); //Запускать преобразование программно
    CLEAR_BIT(ADC1->CTLR2, ADC_EXTTRIG); //Conversion on external event disabled
    //SET_BIT(ADC1->CTLR2, ADC_SWSTART); //Начать преобразование
    //SET_BIT(ADC1->CTLR2, ADC_TSVREFE);//Temperature sensor and VREFINT channel enabled

    // 12.3.5 ADCx Sample Time Configuration Register 2 (ADCx_SAMPTR2) (x=1/2)
    MODIFY_REG(ADC1->SAMPTR2, ADC_SMP0, 0b111 << ADC_SMP0_Pos);//239.5 cycles
    MODIFY_REG(ADC1->SAMPTR2, ADC_SMP1, 0b111 << ADC_SMP1_Pos); //239.5 cycles
    //MODIFY_REG(ADC1->SAMPTR1, ADC_SMP17, 0b111 << ADC_SMP17_Pos); //239.5 cycles

    //12.3.9 ADCx Regular Channel Sequence Register1 (ADCx_RSQR1) (x=1/2)
    MODIFY_REG(ADC1->RSQR1, ADC_L, 0b0001 << ADC_L_Pos);//2 преобразования

    //12.3.11 ADCx Regular Channel Sequence Register 3 (ADCx_RSQR3) (x=1/2)
    MODIFY_REG(ADC1->RSQR3, ADC_SQ1, 0 << ADC_SQ1_Pos);
    MODIFY_REG(ADC1->RSQR3, ADC_SQ2, 1 << ADC_SQ2_Pos);
    //NVIC_EnableIRQ(ADC1_2_IRQn); //Разрешить прерывания по АЦП

    //SET_BIT(ADC1->CTLR2, ADC_SWSTART); //Начать преобразование. Не нужно запускать, если Continuous conversion mode(непрерывные преобразования) включен

}

__WEAK void ADC1_2_IRQHandler(void) {
    if (READ_BIT(ADC1->STATR, ADC_EOC)) {
        ADC1->IDATAR1; //Читаем канал, чтоб сбросить флаг
    }

}
__WEAK void DMA1_Channel1_IRQHandler(void) {
    if (READ_BIT(DMA1->INTFR, DMA_TCIF1)) {
        SET_BIT(DMA1->INTFCR, DMA_CGIF1); //Сбросим глобальный флаг.
        /*Здесь можно писать код*/

    } else if (READ_BIT(DMA1->INTFR, DMA_TEIF1)) {
        /*Здесь можно сделать какой-то обработчик ошибок*/
        SET_BIT(DMA1->INTFCR, DMA_CGIF1); //Сбросим глобальный флаг.
    }
}

/*================================= НАСТРОЙКА USART ============================================*/

/**
 ***************************************************************************************
 *  @breif Universal synchronous asynchronous receiver transmitter (USART)
 ***************************************************************************************
 */

struct USART_name husart1; //Объявляем структуру по USART.(см. ch32v203x_RVMSIS.h)
struct USART_name husart2; //Объявляем структуру по USART.(см. ch32v203x_RVMSIS.h)

/**
 ******************************************************************************
 *  @breif Настройка USART1. Параметры 9600 8 N 1
 ******************************************************************************
 */

void RVMSIS_USART1_Init(void) {

    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOA); //Включение тактирование порта А
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_AFIO); //Включение альтернативных функций

    //Для конфигурирование ножек UART для Full Duplex нужно использовать Alternate function push-pull(См. п.п. 9.1.11 GPIO configurations for device peripherals стр.111 Reference Manual)
    //Tx - Alternative Function output Push-pull(Maximum output speed 50 MHz)
    MODIFY_REG(GPIOA->CFGHR, GPIO_CFGHR_CNF9, 0b10 << GPIO_CFGHR_CNF9_Pos);
    MODIFY_REG(GPIOA->CFGHR, GPIO_CFGHR_MODE9, 0b11 << GPIO_CFGHR_MODE9_Pos);
    //Rx - Input floating
    MODIFY_REG(GPIOA->CFGHR, GPIO_CFGHR_CNF10, 0b1 << GPIO_CFGHR_CNF10_Pos);
    MODIFY_REG(GPIOA->CFGHR, GPIO_CFGHR_MODE10, 0b00 << GPIO_CFGHR_MODE10_Pos);

    //Запустим тактирование USART1
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_USART1);

    /*Расчет Fractional baud rate generation
     есть формула:
     Tx/Rx baud = fCK/(16*USARTDIV)
     где fCK - Input clock to the peripheral (PCLK1 for USART2, 3, 4, 5 or PCLK2 for USART1)
     в нашем случае fCK = 72000000
     допустим нам нужна скорость 9600
     9600 = 72000000/(16*USARTDIV)
     Тогда USARTDIV = 72000000/9600*16 = 468.75
     DIV_Mantissa в данном случае будет 468, что есть 0x1D4
     DIV_Fraction будет, как 0.75*16 = 12, что есть 0xC
     Тогда весь регистр USART->BRR для скорости 9600 будет выглядеть, как 0x1D4C.
     для примера еще разберем скорость 115200:
     115200 = 72000000/(16*USARTDIV)
     Тогда USARTDIV = 72000000/115200*16 = 39.0625
     DIV_Mantissa в данном случае будет 39, что есть 0x27
     DIV_Fraction будет, как 0.0625*16 = 1, что есть 0x1
     Тогда весь регистр USART->BRR для скорости 115200 будет выглядеть, как 0x271.
     */

