Solderingironspb/CH32V203C8T6_RVMSIS_notes/CH32V203C8T6/Core/Src/ch32v20x_RVMSIS.c
    MODIFY_REG(USART1->BRR, USART_BRR_DIV_Mantissa, 0x1D4 << USART_BRR_DIV_Mantissa_Pos);
    MODIFY_REG(USART1->BRR, USART_BRR_DIV_Fraction, 0xC << USART_BRR_DIV_Mantissa_Pos);

    //18.10.4 USART Control Register1 (USARTx_CTLR1) (x=1/2/3/4/5/6/7/8)
    SET_BIT(USART1->CTLR1, USART_CTLR1_UE);//USART enable
    CLEAR_BIT(USART1->CTLR1, USART_CTLR1_M); //Word lenght 1 Start bit, 8 Data bits, n Stop bit
    CLEAR_BIT(USART1->CTLR1, USART_CTLR1_WAKE); //Wake up idle Line
    CLEAR_BIT(USART1->CTLR1, USART_CTLR1_PCE); //Partity control disabled
    //настройка прерываний
    CLEAR_BIT(USART1->CTLR1, USART_CTLR1_PEIE);//partity error interrupt disabled
    CLEAR_BIT(USART1->CTLR1, USART_CTLR1_TXEIE); //TXE interrupt is inhibited
    CLEAR_BIT(USART1->CTLR1, USART_CTLR1_TCIE); //Transmission complete interrupt disabled
    SET_BIT(USART1->CTLR1, USART_CTLR1_RXNEIE); //Прерывание по приему данных включено
    SET_BIT(USART1->CTLR1, USART_CTLR1_IDLEIE); //Прерывание по флагу IDLE включено
    SET_BIT(USART1->CTLR1, USART_CTLR1_TE); //Transmitter is enabled
    SET_BIT(USART1->CTLR1, USART_CTLR1_RE); //Receiver is enabled and begins searching for a start bit
    CLEAR_BIT(USART1->CTLR1, USART_CTLR1_RWU);
    CLEAR_BIT(USART1->CTLR1, USART_CTLR1_SBK);

    //Остальную настройку, не касающуюся стандартного USART, мы пока трогать не будем, но на всякий случай обнулим
    //18.10.5 USART Control Register2 (USARTx_CTLR2) (x=1/2/3/4/5/6/7/8)
    USART1->CTLR2 = 0;
    CLEAR_BIT(USART1->CTLR2, USART_CTLR2_STOP); //1 стоп бит.
    //18.10.6 USART Control Register 3 (USARTx_CTLR3) (x=1/2/3/4/5/6/7/8)
    USART1->CTLR3 = 0;
    //18.10.7 USART Guard Time and Prescaler Register (USARTx_GPR) (x=1/2/3/4/5/6/7/8)
    USART1->GPR = 0;

    NVIC_EnableIRQ(USART1_IRQn); //Включим прерывания по USART1
}

/**
 ******************************************************************************
 *  @breif Настройка USART2. Параметры 9600 8 N 1
 ******************************************************************************
 */

void CMSIS_USART2_Init(void) {

    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOA); //Включение тактирование порта А
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_AFIO); //Включение альтернативных функций

    //Для конфигурирование ножек UART для Full Duplex нужно использовать Alternate function push-pull(См. п.п. 9.1.11 GPIO configurations for device peripherals стр.111 Reference Manual)
    //Tx - Alternative Function output Push-pull(Maximum output speed 50 MHz)
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_CNF2, 0b10 << GPIO_CFGLR_CNF2_Pos);
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_MODE2, 0b11 << GPIO_CFGLR_MODE2_Pos);
    //Rx - Input floating
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_CNF3, 0b1 << GPIO_CFGLR_CNF3_Pos);
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_MODE3, 0b00 << GPIO_CFGLR_MODE3_Pos);

    //Запустим тактирование USART2
    SET_BIT(RCC->APB1PCENR, RCC_APB1Periph_USART2);

    /*Расчет Fractional baud rate generation
     есть формула:
     Tx/Rx baud = fCK/(16*USARTDIV)
     где fCK - Input clock to the peripheral (PCLK1 for USART2, 3, 4, 5 or PCLK2 for USART1)
     в нашем случае fCK = 36000000
     допустим нам нужна скорость 9600
     9600 = 36000000/(16*USARTDIV)
     Тогда USARTDIV = 36000000/9600*16 = 234.375
     DIV_Mantissa в данном случае будет 234, что есть 0xEA
     DIV_Fraction будет, как 0.375*16 = 6, что есть 0x6
     Тогда весь регистр USART->BRR для скорости 9600 будет выглядеть, как 0xEA6.
     для примера еще разберем скорость 115200: (Неточность по скорости будет 0.15%. Не рекомендуется)
     115200 = 36000000/(16*USARTDIV)
     Тогда USARTDIV = 36000000/115200*16 = 19.53125
     DIV_Mantissa в данном случае будет 19, что есть 0x13
     DIV_Fraction будет, как 0.53125*16 = 8, что есть 0x8
     Тогда весь регистр USART->BRR для скорости 115200 будет выглядеть, как 0x138.
     */

    MODIFY_REG(USART2->BRR, USART_BRR_DIV_Mantissa, 0xEA << USART_BRR_DIV_Mantissa_Pos);
    MODIFY_REG(USART2->BRR, USART_BRR_DIV_Fraction, 0x6 << USART_BRR_DIV_Fraction_Pos);

    //18.10.4 USART Control Register1 (USARTx_CTLR1) (x=1/2/3/4/5/6/7/8)
    SET_BIT(USART2->CTLR1, USART_CTLR1_UE);//USART enable
    CLEAR_BIT(USART2->CTLR1, USART_CTLR1_M); //Word lenght 1 Start bit, 8 Data bits, n Stop bit
    CLEAR_BIT(USART2->CTLR1, USART_CTLR1_WAKE); //Wake up idle Line
    CLEAR_BIT(USART2->CTLR1, USART_CTLR1_PCE); //Partity control disabled
    //настройка прерываний
    CLEAR_BIT(USART2->CTLR1, USART_CTLR1_PEIE);//partity error interrupt disabled
    CLEAR_BIT(USART2->CTLR1, USART_CTLR1_TXEIE); //TXE interrupt is inhibited
    CLEAR_BIT(USART2->CTLR1, USART_CTLR1_TCIE); //Transmission complete interrupt disabled
    SET_BIT(USART2->CTLR1, USART_CTLR1_RXNEIE); //Прерывание по приему данных включено
    SET_BIT(USART2->CTLR1, USART_CTLR1_IDLEIE); //Прерывание по флагу IDLE включено
    SET_BIT(USART2->CTLR1, USART_CTLR1_TE); //Transmitter is enabled
    SET_BIT(USART2->CTLR1, USART_CTLR1_RE); //Receiver is enabled and begins searching for a start bit
    CLEAR_BIT(USART2->CTLR1, USART_CTLR1_RWU);
    CLEAR_BIT(USART2->CTLR1, USART_CTLR1_SBK);

    //Остальную настройку, не касающуюся стандартного USART, мы пока трогать не будем, но на всякий случай обнулим
    //18.10.5 USART Control Register2 (USARTx_CTLR2) (x=1/2/3/4/5/6/7/8)
    USART2->CTLR2 = 0;
    CLEAR_BIT(USART2->CTLR2, USART_CTLR2_STOP); //1 стоп бит.
    //18.10.6 USART Control Register 3 (USARTx_CTLR3) (x=1/2/3/4/5/6/7/8)
    USART2->CTLR3 = 0;
    //18.10.7 USART Guard Time and Prescaler Register (USARTx_GPR) (x=1/2/3/4/5/6/7/8)
    USART2->GPR = 0;

    NVIC_EnableIRQ(USART2_IRQn); //Включим прерывания по USART2
}

/**
 ******************************************************************************
 *  @breif Прерывание по USART1
 ******************************************************************************
 */

__WEAK void USART1_IRQHandler(void) {
    if (READ_BIT(USART1->STATR, USART_STATR_RXNE)) {
        //Если пришли данные по USART
        husart1.rx_buffer[husart1.rx_counter] = USART1->DATAR; //Считаем данные в соответствующую ячейку в rx_buffer
        husart1.rx_counter++; //Увеличим счетчик принятых байт на 1
    }
    if (READ_BIT(USART1->STATR, USART_STATR_IDLE)) {
        //Если прилетел флаг IDLE
        USART1->DATAR; //Сбросим флаг IDLE
        husart1.rx_len = husart1.rx_counter; //Узнаем, сколько байт получили
        husart1.rx_counter = 0; //сбросим счетчик приходящих данных
    }
}

/**
 ******************************************************************************
 *  @breif Прерывание по USART1
 ******************************************************************************
 */

