Solderingironspb/CH32V203C8T6_RVMSIS_notes/CH32V203C8T6/Core/Src/ch32v20x_RVMSIS.c
    /*-------------------Проверка занятости шины-------------------*/
    if (READ_BIT(I2C->STAR2, I2C_STAR2_BUSY)) {
        //Если шина занята

        if ((READ_BIT(GPIOB->INDR, GPIO_INDR_IDR6)) && (READ_BIT(GPIOB->INDR, GPIO_INDR_IDR7))) {
            //Если линия на самом деле свободна, а BUSY висит
            RVMSIS_I2C_Reset(); //ресет
            RVMSIS_I2C1_Init(); //повторная инициализация
        }

        if (READ_BIT(I2C->STAR2, I2C_STAR2_MSL)) {
            //Если стоит статус, что мы в мастере
            SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Отправим сигнал STOP
        }

        if (I2C->CTLR1 != 1) {
            //Если в CR1 что-то лишнее, то перезагрузим I2C
            CLEAR_BIT(I2C->CTLR1, I2C_CTLR1_PE);
            SET_BIT(I2C->CTLR1, I2C_CTLR1_PE);
        }

        return false;
    }
    /*-------------------Проверка занятости шины-------------------*/

    CLEAR_BIT(I2C->CTLR1, I2C_CTLR1_POS); //Бит ACK управляет (N)ACK текущего байта, принимаемого в сдвиговом регистре.
    SET_BIT(I2C->CTLR1, I2C_CTLR1_START); //Отправляем сигнал START

    Timeout_counter_ms = Timeout_ms;
    while (READ_BIT(I2C->STAR1, I2C_STAR1_SB) == 0) {
        //Ожидаем до момента, пока не сработает Start condition generated

        if (!Timeout_counter_ms) {
            return false;
        }

    }
    //ВНИМАНИЕ!
    /* Бит I2C_SR1_SB очищается программно путем чтения регистра SR1 с последующей записью данных в регистр DR или когда PE=0*/
    I2C->STAR1;
    I2C->DATAR = (Adress_Device << 1); //Адрес + Write

    Timeout_counter_ms = Timeout_ms;
    while ((READ_BIT(I2C->STAR1, I2C_STAR1_AF) == 0) && (READ_BIT(I2C->STAR1, I2C_STAR1_ADDR) == 0)) {
        //Ждем, пока адрес отзовется

        if (!Timeout_counter_ms) {
            return false;
        }

    }

    if (READ_BIT(I2C->STAR1, I2C_STAR1_ADDR)) {
        //Если устройство отозвалось
        SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Отправляем сигнал STOP
        /*Сброс бита ADDR производится чтением SR1, а потом SR2*/
        I2C->STAR1;
        I2C->STAR2;
        return true;
    } else {
        //Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF
        SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Отправляем сигнал STOP
        CLEAR_BIT(I2C->STAR1, I2C_STAR1_AF); //Сбрасываем бит AF
        return false;
    }
}

/**
 **************************************************************************************************
 *  @breif Функция передачи данных по I2C
 *  @param  *I2C - шина I2C
 *  @param  Adress_Device - Адрес устройства
 *  @param  *data - Данные, которые будем отправлять
 *  @param  Size_data - Размер, сколько байт будем отправлять.
 *  @retval  Возвращает статус отправки данных. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool RVMSIS_I2C_Data_Transmit(I2C_TypeDef* I2C, uint8_t Adress_Device, uint8_t* data, uint16_t Size_data, uint32_t Timeout_ms) {

    /*-------------------Проверка занятости шины-------------------*/
    if (READ_BIT(I2C->STAR2, I2C_STAR2_BUSY)) {
        //Если шина занята

        if ((READ_BIT(GPIOB->INDR, GPIO_INDR_IDR6)) && (READ_BIT(GPIOB->INDR, GPIO_INDR_IDR7))) {
            //Если линия на самом деле свободна, а BUSY висит
            RVMSIS_I2C_Reset(); //ресет
            RVMSIS_I2C1_Init(); //повторная инициализация
        }

        if (READ_BIT(I2C->STAR2, I2C_STAR2_MSL)) {
            //Если стоит статус, что мы в мастере
            SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Отправим сигнал STOP
        }

        if (I2C->CTLR1 != 1) {
            //Если в CR1 что-то лишнее, то перезагрузим I2C
            CLEAR_BIT(I2C->CTLR1, I2C_CTLR1_PE);
            SET_BIT(I2C->CTLR1, I2C_CTLR1_PE);
        }

        return false;
    }
    /*-------------------Проверка занятости шины-------------------*/

    CLEAR_BIT(I2C->CTLR1, I2C_CTLR1_POS); //Бит ACK управляет (N)ACK текущего байта, принимаемого в сдвиговом регистре.
    SET_BIT(I2C->CTLR1, I2C_CTLR1_START); //Стартуем.

    Timeout_counter_ms = Timeout_ms;
    while (READ_BIT(I2C->STAR1, I2C_STAR1_SB) == 0) {
        //Ожидаем до момента, пока не сработает Start condition generated

        if (!Timeout_counter_ms) {
            return false;
        }

    }
    //ВНИМАНИЕ!
    /* Бит I2C_SR1_SB очищается программно путем чтения регистра SR1 с последующей записью в регистр DR или когда PE=0*/
    I2C->STAR1;
    I2C->DATAR = (Adress_Device << 1); //Адрес + Write

    Timeout_counter_ms = Timeout_ms;
    while ((READ_BIT(I2C->STAR1, I2C_STAR1_AF) == 0) && (READ_BIT(I2C->STAR1, I2C_STAR1_ADDR) == 0)) {
        //Ждем, пока адрес отзовется

        if (!Timeout_counter_ms) {
            return false;
        }

    }

    if (READ_BIT(I2C->STAR1, I2C_STAR1_ADDR)) {
        //Если устройство отозвалось, сбросим бит ADDR
        /*Сброс бита ADDR производится чтением SR1, а потом SR2*/
        I2C->STAR1;
        I2C->STAR2;

        /*Отправим данные*/
        for (uint16_t i = 0; i < Size_data; i++) {
            I2C->DATAR = *(data + i); //Запись байта
            while (READ_BIT(I2C->STAR1, I2C_STAR1_TXE) == 0) {
                //Ждем, пока данные загрузятся в регистр сдвига.

                if ((READ_BIT(I2C->STAR1, I2C_STAR1_AF) == 1)) {
                    //Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF
                    SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP);//Останавливаем
                    CLEAR_BIT(I2C->STAR1, I2C_STAR1_AF);//Сбрасываем бит AF
                    return false;
                }
            }
        }

        SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Останавливаем

        return true;

    } else {
        //Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF
        SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Останавливаем
        CLEAR_BIT(I2C->STAR1, I2C_STAR1_AF); //Сбрасываем бит AF

        return false;
    }
}

/**
 **************************************************************************************************
 *  @breif Функция приема данных по I2C
 *  @param  *I2C - шина I2C
 *  @param  Adress_Device - Адрес устройства
 *  @param  *data - Куда будем записывать принятые данные
 *  @param  Size_data - Размер, сколько байт будем принимать.
 *  @retval  Возвращает статус приема данных. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool RVMSIS_I2C_Data_Receive(I2C_TypeDef* I2C, uint8_t Adress_Device, uint8_t* data, uint16_t Size_data, uint32_t Timeout_ms) {

