Solderingironspb/CH32V203C8T6_RVMSIS_notes/CH32V203C8T6/Core/Src/ch32v20x_RVMSIS.c
    }
    if (READ_BIT(I2C->STAR1, I2C_STAR1_ADDR)) {
        //Если устройство отозвалось, сбросим бит ADDR
        /*Сброс бита ADDR производится чтением SR1, а потом SR2*/
        I2C->STAR1;
        I2C->STAR2;

        /*Отправим адрес памяти*/
        for (uint16_t i = 0; i < Size_adress; i++) {
            I2C->DATAR = *((uint8_t*) &Adress_data + (Size_adress - 1 - i)); //Запись байта
            while (READ_BIT(I2C->STAR1, I2C_STAR1_TXE) == 0) {
                //Ждем, пока данные загрузятся в регистр сдвига.

                if ((READ_BIT(I2C->STAR1, I2C_STAR1_AF) == 1)) {
                    //Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF
                    SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP);//Останавливаем
                    CLEAR_BIT(I2C->STAR1, I2C_STAR1_AF);//Сбрасываем бит AF
                    return false;
                }
            }
        }

        /*Будем записывать данные в ячейку памяти, начиная с указанного адреса*/
        for (uint16_t i = 0; i < Size_data; i++) {
            I2C->DATAR = *(data + i); //Запись байта
            while (READ_BIT(I2C->STAR1, I2C_STAR1_TXE) == 0) {
                //Ждем, пока данные загрузятся в регистр сдвига.

                if ((READ_BIT(I2C->STAR1, I2C_STAR1_AF) == 1)) {
                    //Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF
                    SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP);//Останавливаем
                    CLEAR_BIT(I2C->STAR1, I2C_STAR1_AF);//Сбрасываем бит AF
                    return false;
                }
            }
        }

        SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Останавливаем

        return true;

    } else {
        //Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF
        SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Останавливаем
        CLEAR_BIT(I2C->STAR1, I2C_STAR1_AF); //Сбрасываем бит AF

        return false;
    }
}

/**
 **************************************************************************************************
 *  @breif Функция чтения из памяти по указанному адресу
 *  @param  *I2C - шина I2C
 *  @param  Adress_Device - Адрес устройства
 *  @param  Adress_data - Адрес в памяти, откуда будем считывать данные
 *  @param  Size_adress - Размер адреса в байтах. Пример: 1 - 8 битный адрес. 2 - 16 битный адрес.
 *  @param  *data - Данные, в которые будем записывать считанную информацию.
 *  @param  Size_data - Размер, сколько байт будем считывать.
 *  @retval  Возвращает статус считывания. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool RVMSIS_I2C_MemRead(I2C_TypeDef* I2C, uint8_t Adress_Device, uint16_t Adress_data, uint8_t Size_adress, uint8_t* data, uint16_t Size_data, uint32_t Timeout_ms) {

    /*-------------------Проверка занятости шины-------------------*/
    if (READ_BIT(I2C->STAR2, I2C_STAR2_BUSY)) {
        //Если шина занята

        if ((READ_BIT(GPIOB->INDR, GPIO_INDR_IDR6)) && (READ_BIT(GPIOB->INDR, GPIO_INDR_IDR7))) {
            //Если линия на самом деле свободна, а BUSY висит
            RVMSIS_I2C_Reset(); //ресет
            RVMSIS_I2C1_Init(); //повторная инициализация
        }

        if (READ_BIT(I2C->STAR2, I2C_STAR2_MSL)) {
            //Если стоит статус, что мы в мастере
            SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Отправим сигнал STOP
        }

        if (I2C->CTLR1 != 1) {
            //Если в CR1 что-то лишнее, то перезагрузим I2C
            CLEAR_BIT(I2C->CTLR1, I2C_CTLR1_PE);
            SET_BIT(I2C->CTLR1, I2C_CTLR1_PE);
        }

        return false;
    }
    /*-------------------Проверка занятости шины-------------------*/

    CLEAR_BIT(I2C->CTLR1, I2C_CTLR1_POS); //Бит ACK управляет (N)ACK текущего байта, принимаемого в сдвиговом регистре.
    SET_BIT(I2C->CTLR1, I2C_CTLR1_START); //Стартуем.

    Timeout_counter_ms = Timeout_ms;
    while (READ_BIT(I2C->STAR1, I2C_STAR1_SB) == 0) {
        //Ожидаем до момента, пока не сработает Start condition generated

        if (!Timeout_counter_ms) {
            return false;
        }

    }
    //ВНИМАНИЕ!
    /* Бит I2C_SR1_SB очищается программно путем чтения регистра SR1 с последующей записью в регистр DR или когда PE=0*/
    I2C->STAR1;
    I2C->DATAR = (Adress_Device << 1); //Адрес + команда Write

    Timeout_counter_ms = Timeout_ms;
    while ((READ_BIT(I2C->STAR1, I2C_STAR1_AF) == 0) && (READ_BIT(I2C->STAR1, I2C_STAR1_ADDR) == 0)) {
        //Ждем, пока адрес отзовется

        if (!Timeout_counter_ms) {
            return false;
        }

    }

    if (READ_BIT(I2C->STAR1, I2C_STAR1_ADDR)) {
        //Если устройство отозвалось, сбросим бит ADDR
        /*Сброс бита ADDR производится чтением SR1, а потом SR2*/
        I2C->STAR1;
        I2C->STAR2;

        /*Отправим адрес памяти*/
        for (uint16_t i = 0; i < Size_adress; i++) {
            I2C->DATAR = *((uint8_t*) &Adress_data + (Size_adress - 1 - i)); //Запись байта
            while (READ_BIT(I2C->STAR1, I2C_STAR1_TXE) == 0) {
                //Ждем, пока данные загрузятся в регистр сдвига.

                if ((READ_BIT(I2C->STAR1, I2C_STAR1_AF) == 1)) {
                    //Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF
                    SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP);//Останавливаем
                    CLEAR_BIT(I2C->STAR1, I2C_STAR1_AF);//Сбрасываем бит AF
                    return false;
                }
            }
        }

        //Повторный старт
        SET_BIT(I2C->CTLR1, I2C_CTLR1_START); //Стартуем.

        Timeout_counter_ms = Timeout_ms;
        while (READ_BIT(I2C->STAR1, I2C_STAR1_SB) == 0) {
            //Ожидаем до момента, пока не сработает Start condition generated

            if (!Timeout_counter_ms) {
                return false;
            }

        }
        //ВНИМАНИЕ!
        /* Бит I2C_SR1_SB очищается программно путем чтения регистра SR1 с последующей записью в регистр DR или когда PE=0*/
        I2C->STAR1;
        I2C->DATAR = (Adress_Device << 1 | 1); //Адрес + команда Read

        Timeout_counter_ms = Timeout_ms;
        while ((READ_BIT(I2C->STAR1, I2C_STAR1_AF) == 0) && (READ_BIT(I2C->STAR1, I2C_STAR1_ADDR) == 0)) {
            //Ждем, пока адрес отзовется

            if (!Timeout_counter_ms) {
                return false;
            }

