Solderingironspb/CH32V203C8T6_RVMSIS_notes/CH32V203C8T6/Core/Src/ch32v20x_RVMSIS.c
        }

        if (READ_BIT(I2C->STAR1, I2C_STAR1_ADDR)) {
            //Если устройство отозвалось, сбросим бит ADDR
            /*Сброс бита ADDR производится чтением SR1, а потом SR2*/
            I2C->STAR1;
            I2C->STAR2;

            /*Прочтем данные, начиная с указанного адреса*/
            for (uint16_t i = 0; i < Size_data; i++) {
                if (i < Size_data - 1) {
                    SET_BIT(I2C->CTLR1, I2C_CTLR1_ACK); //Если мы хотим принять следующий байт, то отправляем ACK
                    while (READ_BIT(I2C->STAR1, I2C_STAR1_RXNE) == 0);
                    *(data + i) = I2C->DATAR; //Чтение байта
                } else {
                    CLEAR_BIT(I2C->CTLR1, I2C_CTLR1_ACK); //Если мы знаем, что следующий принятый байт будет последним, то отправим NACK

                    SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Останавливаем
                    while (READ_BIT(I2C->STAR1, I2C_STAR1_RXNE) == 0);
                    //Подождем, пока сдвиговый регистр пополнится новым байтом данных
                    *(data + i) = I2C->DATAR; //Чтение байта
                }
            }
            return true;

        } else {
            //Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF
            SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Останавливаем
            CLEAR_BIT(I2C->STAR1, I2C_STAR1_AF); //Сбрасываем бит AF
            return false;
        }

    } else {
        //Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF
        SET_BIT(I2C->CTLR1, I2C_CTLR1_STOP); //Останавливаем
        CLEAR_BIT(I2C->STAR1, I2C_STAR1_AF); //Сбрасываем бит AF
        return false;
    }
}

/*================================= НАСТРОЙКА SPI ============================================*/

/**
***************************************************************************************
*  @breif Serial peripheral interface (SPI)
***************************************************************************************
*/

void RVMSIS_SPI1_init(void) {
    /*Настройка GPIO*/
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_AFIO); //Включение альтернативных функций
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_SPI1); //Включение тактирования SPI1
    SET_BIT(RCC->APB2PCENR, RCC_APB2Periph_GPIOA); //Включение тактирования порта А
    /*Какие ножки:*/
    //PA4 - NSS
    //PA5 - SCK
    //PA6 - MISO
    //PA7 - MOSI
    //Мы будем настраивать SPI в режим Master
    /*
     * SPIx_SCK  Master - Alternate function push-pull
     * SPIx_MOSI:
     *             Full duplex / master - Alternate function push-pull
     *             Simplex bidirectional data wire / master - Alternate function push-pull
     * SPIx_MISO:
     *             Full duplex / master - Input floating / Input pull-up
     *
     * SPIx_NSS:
     *             Hardware master /slave - Input floating/ Input pull-up / Input pull-down
     *             Hardware master/ NSS output enabled - Alternate function push-pull
     *             Software - Not used. Can be used as a GPIO
     */
     //Настроим сами ножки уже после инициализации SPI, чтоб при старте не было лишних ногодерганий.

    //20.4.1 SPI Control Register 1 (SPIx_CTLR1) (x=1/2/3)
    MODIFY_REG(SPI1->CTLR1, SPI_CTLR1_BR, 0b011 << SPI_CTLR1_BR_Pos); //fPCLK/4. 72000000/32 = 2.22 MBits/s
    SET_BIT(SPI1->CTLR1, SPI_CTLR1_CPOL); //Полярность
    SET_BIT(SPI1->CTLR1, SPI_CTLR1_CPHA); //Фаза
    CLEAR_BIT(SPI1->CTLR1, SPI_CTLR1_DFF); //0: 8-bit data frame format is selected for transmission/reception
    CLEAR_BIT(SPI1->CTLR1, SPI_CTLR1_LSBFIRST); //0: MSB transmitted first
    SET_BIT(SPI1->CTLR1, SPI_CTLR1_SSM); //1: Software slave management enabled
    SET_BIT(SPI1->CTLR1, SPI_CTLR1_SSI); //1: Software slave management enabled
    SET_BIT(SPI1->CTLR1, SPI_CTLR1_MSTR); //1: Master configuration
    CLEAR_BIT(SPI1->CTLR1, SPI_CTLR1_BIDIMODE); //0: 2-line unidirectional data mode selected
    CLEAR_BIT(SPI1->CTLR1, SPI_CTLR1_RXONLY); //0: Full duplex (Transmit and receive)

    SET_BIT(SPI1->CTLR1, SPI_CTLR1_SPE); //Включим SPI

    CLEAR_BIT(SPI1->CTLR1, SPI_CTLR1_CRCEN); //0: CRC calculation disabled
    CLEAR_BIT(SPI1->CTLR1, SPI_CTLR1_CRCNEXT); // 0: Data phase (no CRC phase)



    //20.4.2 SPI Control Register 2 (SPIx_CTLR2) (x=1/2/3)
    CLEAR_BIT(SPI1->CTLR2, SPI_CTLR2_RXDMAEN); //0: Rx buffer DMA disabled
    CLEAR_BIT(SPI1->CTLR2, SPI_CTLR2_TXDMAEN); //0: Tx buffer DMA disabled
    CLEAR_BIT(SPI1->CTLR2, SPI_CTLR2_SSOE); //0: SS output is disabled in master mode and the cell can work in multimaster configuration
    CLEAR_BIT(SPI1->CTLR2, SPI_CTLR2_ERRIE); //0: Error interrupt is masked
    CLEAR_BIT(SPI1->CTLR2, SPI_CTLR2_RXNEIE); //0: RXNE interrupt masked
    CLEAR_BIT(SPI1->CTLR2, SPI_CTLR2_TXEIE); //0: TXE interrupt masked

    //20.4.8 SPI_I2S Configuration Register (SPI_I2S_CFGR) (x=1/2/3)
    CLEAR_BIT(SPI1->I2SCFGR, SPI_I2SCFGR_I2SMOD); //т.к. на F103C6T6 нет I2S, его вырезали, а регистр оставили, нужно просто обнулить данный регистр. Тем самым включим режим SPI mode.


    //SCK - PA5:
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_MODE5, 0b11 << GPIO_CFGLR_MODE5_Pos); //Maximum output speed 50 MHz
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_CNF5, 0b10 << GPIO_CFGLR_CNF5_Pos); //Alternate Function output Push-pull
    //MISO - PA6:
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_MODE6, 0b00 << GPIO_CFGLR_MODE6_Pos); //Reserved
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_CNF6, 0b1 << GPIO_CFGLR_CNF6_Pos); //Input pull-up
    SET_BIT(GPIOA->OUTDR, GPIO_OUTDR_ODR6); //Pull-Up
    //MOSI - PA7:
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_MODE7, 0b11 << GPIO_CFGLR_MODE7_Pos); //Maximum output speed 50 MHz
    MODIFY_REG(GPIOA->CFGLR, GPIO_CFGLR_CNF7, 0b10 << GPIO_CFGLR_CNF7_Pos); //Alternate Function output Push-pull
}

/**
 **************************************************************************************************
 *  @breif Функция передачи данных по шине SPI
 *  @param  *SPI - шина SPI
 *  @param  *data - Данные, которые будем передавать.
 *  @param  Size_data - Размер, сколько байт будем передавать.
 *  @retval  Возвращает статус передачи. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool RVMSIS_SPI_Data_Transmit_8BIT(SPI_TypeDef* SPI, uint8_t* data, uint16_t Size_data, uint32_t Timeout_ms) {
    //(см. Reference Manual стр. 712 Transmit-only procedure (BIDIMODE=0 RXONLY=0))
    if (!READ_BIT(SPI->STATR, SPI_STATR_BSY)) {
        //Проверим занятость шины
        SPI->DATAR = *(data); //Запишем первый элемент данных для отправки в регистр SPI_DR
        //(При этом очищается бит TXE)

        for (uint16_t i = 1; i < Size_data; i++) {
            Timeout_counter_ms = Timeout_ms;
            while (!READ_BIT(SPI->STATR, SPI_STATR_TXE)) {
                //Ждем, пока буфер на передачу не освободится
                if (!Timeout_counter_ms) {
                    return false;
                }
            }
            SPI->DATAR = *(data + i); //Запишем следующий элемент данных.
        }
        Timeout_counter_ms = Timeout_ms;
        while (!READ_BIT(SPI->STATR, SPI_STATR_TXE)) {
            //После записи последнего элемента данных в регистр SPI_DR,
            //подождем, пока TXE станет равным 1.
            if (!Timeout_counter_ms) {
                return false;
            }
        }
        Timeout_counter_ms = Timeout_ms;
        while (READ_BIT(SPI->STATR, SPI_STATR_BSY)) {
            //Затем подождем, пока BSY станет равным 0.
            //Это указывает на то, что передача последних данных завершена.
            if (!Timeout_counter_ms) {
                return false;
            }
        }
        return true;
    }
    else {
        return false;
    }
    //Примечание:
    //После передачи двух элементов данных в режиме "transmit-only mode" в регистре SPI_SR устанавливается флаг OVR, так как принятые данные никогда не считываются.
}

/**
 **************************************************************************************************
 *  @breif Функция передачи данных по шине SPI
 *  @param  *SPI - шина SPI
 *  @param  *data - Данные, которые будем передавать.
 *  @param  Size_data - сколько 16 - битных данных хотим передать. Т.е. 1 = 2 байта.
 *  @retval  Возвращает статус передачи. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool RVMSIS_SPI_Data_Transmit_16BIT(SPI_TypeDef* SPI, uint16_t* data, uint16_t Size_data, uint32_t Timeout_ms) {
    //(см. Reference Manual стр. 712 Transmit-only procedure (BIDIMODE=0 RXONLY=0))
    if (!READ_BIT(SPI->STATR, SPI_STATR_BSY)) {
        //Проверим занятость шины
        SPI->DATAR = *(data); //Запишем первый элемент данных для отправки в регистр SPI_DR
        //(При этом очищается бит TXE)

        for (uint16_t i = 1; i < Size_data; i++) {
            Timeout_counter_ms = Timeout_ms;
            while (!READ_BIT(SPI->STATR, SPI_STATR_TXE)) {
                //Ждем, пока буфер на передачу не освободится
                if (!Timeout_counter_ms) {
                    return false;
                }
            }
            SPI->DATAR = *(data + i); //Запишем следующий элемент данных.
        }
        Timeout_counter_ms = Timeout_ms;
        while (!READ_BIT(SPI->STATR, SPI_STATR_TXE)) {
            //После записи последнего элемента данных в регистр SPI_DR,
            //подождем, пока TXE станет равным 1.
            if (!Timeout_counter_ms) {
                return false;
            }
        }
        Timeout_counter_ms = Timeout_ms;
        while (READ_BIT(SPI->STATR, SPI_STATR_BSY)) {
            //Затем подождем, пока BSY станет равным 0.
            //Это указывает на то, что передача последних данных завершена.
            if (!Timeout_counter_ms) {
                return false;
            }
        }
        return true;
    }
    else {
        return false;
    }
    //Примечание:
    //После передачи двух элементов данных в режиме "transmit-only mode" в регистре SPI_SR устанавливается флаг OVR, так как принятые данные никогда не считываются.
}

/**
 **************************************************************************************************
 *  @breif Функция приема данных по шине SPI
 *  @param  *SPI - шина SPI
 *  @param  *data - Данные, куда будем записывать принятые данные.
 *  @param  Size_data - Размер, сколько байт хотим принять.
 *  @retval  Возвращает статус приема. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool RVMSIS_SPI_Data_Receive_8BIT(SPI_TypeDef* SPI, uint8_t* data, uint16_t Size_data, uint32_t Timeout_ms) {
    if (!READ_BIT(SPI->STATR, SPI_STATR_BSY)) {
        //Проверим занятость шины

        if (READ_BIT(SPI->STATR, SPI_STATR_OVR) || READ_BIT(SPI->STATR, SPI_STATR_RXNE)) {
            //Т.к. мы можем принимать данные в любой момент, например после режима "transmit-only mode"
            //то следует проверить статусы OVR и RXNE. Если хотя бы один из них установлен,
            //то сбросим их при помощи чтения регистра DR.
            SPI->DATAR;
        }

        //Начнем прием данных
        for (uint16_t i = 0; i < Size_data; i++) {
            SPI->DATAR = 0; //Запустим тактирование, чтоб считать 8 бит
            Timeout_counter_ms = Timeout_ms;
            while (!READ_BIT(SPI->STATR, SPI_STATR_RXNE)) {
                //Ждем, пока буфер на прием не заполнится
                if (!Timeout_counter_ms) {
                    return false;
                }
            }
            *(data + i) = SPI->DATAR; //Считываем данные
        }

        Timeout_counter_ms = Timeout_ms;
        while (READ_BIT(SPI->STATR, SPI_STATR_BSY)) {
            //Затем подождем, пока BSY станет равным 0.
            //Это указывает на то, что прием последних данных завершен.
            if (!Timeout_counter_ms) {
                return false;
            }
        }
        return true;
    }
    else {
        return false;
    }
}

/**
 **************************************************************************************************
 *  @breif Функция приема данных по шине SPI
 *  @param  *SPI - шина SPI
 *  @param  *data - Данные, куда будем записывать принятые данные.
 *  @param  Size_data - Размер, сколько 16 - битных данных хотим принять. Т.е. 1 = 2 байта.
 *  @retval  Возвращает статус приема. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool RVMSIS_SPI_Data_Receive_16BIT(SPI_TypeDef* SPI, uint16_t* data, uint16_t Size_data, uint32_t Timeout_ms) {
    if (!READ_BIT(SPI->STATR, SPI_STATR_BSY)) {
        //Проверим занятость шины

        if (READ_BIT(SPI->STATR, SPI_STATR_OVR) || READ_BIT(SPI->STATR, SPI_STATR_RXNE)) {
            //Т.к. мы можем принимать данные в любой момент, например после режима "transmit-only mode"
            //то следует проверить статусы OVR и RXNE. Если хотя бы один из них установлен,
            //то сбросим их при помощи чтения регистра DR.
            SPI->DATAR;
        }

        //Начнем прием данных
        for (uint16_t i = 0; i < Size_data; i++) {
            SPI->DATAR = 0; //Запустим тактирование, чтоб считать 16 бит
            Timeout_counter_ms = Timeout_ms;
            while (!READ_BIT(SPI->STATR, SPI_STATR_RXNE)) {
                //Ждем, пока буфер на прием не заполнится
                if (!Timeout_counter_ms) {
                    return false;
                }
            }
            *(data + i) = SPI->DATAR; //Считываем данные
        }

        Timeout_counter_ms = Timeout_ms;
        while (READ_BIT(SPI->STATR, SPI_STATR_BSY)) {
            //Затем подождем, пока BSY станет равным 0.
            //Это указывает на то, что прием последних данных завершен.
            if (!Timeout_counter_ms) {
                return false;
            }
        }
        return true;
    }
    else {
        return false;
    }
}
